{
    "Header.Item1": "About me",
    "Header.Item2": "Experience",
    "Header.Item3": "Projects",
    "Header.Item4": "Contact",
    "Header.cvBtn": "Resume",
    "Header.cvName": "BST_CV.pdf",
    "Banner.Pretitle": "Hello World! My name is",
    "Banner.Description": "I my <span class='underline'>2 years of experience</span> , I made significant strides as a Software Developer at <span class='underline'>Turito Inc,</span> Hyderabad, where I honed the skills in front-end development using <span class='underline'> Angular 8, React,</span><span class='underline'> TypeScript, HTML, and CSS,</span> and engaged in complex projects involving<span class='underline'> SQL, MongoDB, and Scala</span>. My role involved not just coding, but also contributing to code reviews, project architecture discussions, and employing tools like<span class='underline> Jira and Jenkins</span> for efficient project management.",
    "Banner.ActionBtn": "Get in touch",
    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": ["I am an aspiring software developer, currently advancing my skills in Information Technology Project Management with a Masters at Arizona State University,",
     "set to graduate in May 2025. With a strong foundation in Computer Science from IIIT Rajiv Gandhi University, I had excelled academically,",
      "delving into diverse areas such as Advanced Database Management, Big Data, and Cloud Computing. My technical prowess extends across a spectrum of languages and tools,",
      "including Scala, Python, Java, Angular, React, and NodeJS, complemented by my experience with databases and cloud platforms like MySQL, MongoDB, PostgreSQL, and Azure.",
    "Professionally,In my 2 years of experience I made significant strides as a Software Developer at Turito Inc, Hyderabad, where I honed the skills in front-end development using ",
    "Angular 8, TypeScript, and CSS, and engaged in complex projects involving SQL, MongoDB, and Scala. My role involved not just coding, ",
    "but also contributing to code reviews, project architecture discussions, and employing tools like Jira and Jenkins for efficient project management.",
    " In academia, My projects, such as the Mood-Based Music Player with Facial Recognition and Leaves Management System for University Students,",
    " demonstrate my ability to integrate machine learning, data management, and user-friendly design into functional applications.",
    " I am with a blend of academic knowledge and practical experience, through which I am poised to make a significant impact in the field of software development."
    ],
    "Experience.Title": "Experience",
    "Experience.Jobs": [
        {
            "Tab": "Turito.Inc",
            "Title": "Software developer",
            "Date": "September 2021 - September 2023",
            "Description": [
                "Expertly developed and implemented responsive front-end solutions utilizing Angular 8,TypeScript, and CSS, enhancing user interface and experience.",
                "Actively collaborated on complex projectsinvolving SQL, MongoDB, and Scala, working closely with senior developers.",
                "Played a key role in debugging and quality testing; optimized code forsuperior application performance.",
                "Contributed to code reviews and engaged in team discussions on project architecture and design, ensuring best practices.",
                "Authored new code modules from scratch for company websites, integrating innovative features and functionalities using Angular and Scala.",
                "Effectively utilized Jira and Jenkins for project management and continuous integration,streamlining development processes and improving efficiency"
            ]
        },
        
        {
            "Tab": "Freelancer",
            "Title": "Independent",
            "Date": "March 2021 - Present",
            "Description": [
                "Performing the ",
                "Implementing continuous improvements, working on frontend and backend.",
                "Creating platforms with Angular, Nodejs, ExpressJS, React, reactive, and object-oriented programming paradigms.",
                "Automation of processes with data structures.",
                "Design layout with SASS, Bootstrap, Materialize, Prime Faces, etc."
            ]
        }
    ],
    "FeatureProjects.Title": "Projects that I was a part of",
    "FeatureProjects.Label": "Featured Project",
    "FeatureProjects.Projects": [
        {
            "Title": "Outpass Management System",
            "Description":" student leave management system with an emphasis on security and user friendliness, utilizing <span class='underline'> HTML,CSS,Javascript and SQL</span> for enhanced user experience and administrative decision-making",
            "imgs": [
                "assets/images/bbm/image1.png",
                "assets/images/bbm/image2.png"
            ],
            "Technologies": [
                "HTML",
                "CSS",
                "JavaScript",
                "SQL"
            ]
        },
        {
            "Title": "Mood Based Music",
            "Description": "A mood-based music player using <span class='underline'> Python and machine learning </span> for real-time mood detection via <span class='underline'>facial recognition </span>, and developed a responsive UI using Angular, Flask, HTML, CSS, and JavaScript",
            "imgs": [
                "assets/images/school/image1.png",
                "assets/images/school/image2.png"
            ],
            "Technologies": [
                "Angular",
                "SASS",
                "Flask",
                "OpenCV",
                "Tensorflow"
            ]
        },
        {
            "Title": " Angular Char Application",
            "Description": "A angular web chat application to online chat with friends and family which was build using <span class='underline'> Angular, NodeJS, GetStreamio</span>, where we can also create a personal channels in which we can set with a differnt level of Access permissions",
            "imgs": [
                "assets/images/mazhr/image1.png",
                "assets/images/mazhr/image2.png",
                "assets/images/mazhr/image3.png"
            ],
            "demoLink": "",
            "Technologies": [
                "Angular",
                "CSS",
                "Material",
                "HTML",
                "NodeJS"
            ]
        }
    ],
    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
    "Contact.Btn": "Say Hello"
}